In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame,Series

In [2]:
animals = DataFrame(np.arange(16).reshape(4,4),
                   columns = ['w','x','y','z'],
                   index = ['Dog','Cat', 'Bird','Mouse'])
animals

        w   x   y   z
Dog     0   1   2   3
Cat     4   5   6   7
Bird    8   9  10  11
Mouse  12  13  14  15

In [3]:
# refreshing on index/column slicing
animals.iloc[1:2,:2] = np.nan # select row 1 and columns 0,1
animals

          w     x   y   z
Dog     0.0   1.0   2   3
Cat     NaN   NaN   6   7
Bird    8.0   9.0  10  11
Mouse  12.0  13.0  14  15

In [4]:
bahavior_map = {'w':'good','x':'bad', 'y':'good','z':'bad'}

In [5]:
# grouping dframe using dict 
animals_col = animals.groupby(bahavior_map, axis=1)
animals_col.sum()

        bad  good
Dog     4.0   2.0
Cat     7.0   6.0
Bird   20.0  18.0
Mouse  28.0  26.0

In [8]:
behav_series = Series(bahavior_map)
behav_series

w    good
x     bad
y    good
z     bad
dtype: object

In [7]:
# grouping using series
# note we are counting not summing
animals.groupby(behav_series, axis = 1).count()

       bad  good
Dog      2     2
Cat      1     1
Bird     2     2
Mouse    2     2

In [9]:
# grouping by the length of the index, for DOG, len = 3, notice index 3 and column y = 8, this means Dog y + Cat y = 8
animals.groupby(len).sum()

      w     x   y   z
3   0.0   1.0   8  10
4   8.0   9.0  10  11
5  12.0  13.0  14  15

In [2]:
# We can also use groupby with hierarchaly index levels

#Create a hierarchal column index
hier_col = pd.MultiIndex.from_arrays([['NY','NY','NY','SF','SF'],[1,2,3,1,2]],names=['City','sub_value'])

# Create a dframe with hierarchal index
dframe_hr = DataFrame(np.arange(25).reshape(5,5),columns=hier_col)

#Multiply values by 100 for clarity
dframe_hr = dframe_hr*100

#Show
dframe_hr

City         NY                SF
sub_value     1     2     3     1     2
0             0   100   200   300   400
1           500   600   700   800   900
2          1000  1100  1200  1300  1400
3          1500  1600  1700  1800  1900
4          2000  2100  2200  2300  2400